## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # argocd_project.loadtesting will be created
+   resource "argocd_project" "loadtesting" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "environment" = "dev"
            }
+           name             = "loadtesting"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           description  = "loadtesting"
+           source_repos = [
+               "https://github.com/autotune/loadtesting",
+               "https://kedacore.github.io/charts",
            ]

+           cluster_resource_whitelist {
+               group = "*"
+               kind  = "*"
            }

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
        }
    }

  # argocd_repository_credentials.loadtesting will be created
+   resource "argocd_repository_credentials" "loadtesting" {
+       id              = (known after apply)
+       ssh_private_key = (sensitive value)
+       url             = "git@github.com:autotune/loadtesting.git"
+       username        = "git"
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
